[
    {
      "_id": "0282e0e58a5c6yf64fh756u7l9f3xdrg65",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "01",
      "title": "Career Track: Android App Development",
      "balance": "5000",
      "image_url": "https://richestsoft.com/blog/wp-content/uploads/2019/02/Android-app-development.jpg",
      "details": "Android software development is the process by which applications are created for devices running the Android operating system. Google states that[3] Android apps can be written using Kotlin, Java, and C++ languages using the Android software development kit (SDK), while using other languages is also possible. All non-Java virtual machine (JVM) languages, such as Go, JavaScript, C, C++ or assembly, need the help of JVM language code, that may be supplied by tools, likely with restricted API support. Some programming languages and tools allow cross-platform app support (i.e. for both Android and iOS). Third party tools, development environments, and language support have also continued to evolve and expand since the initial SDK was released in 2008. The official Android app distribution mechanism to end users is Google Play; it also allows staged gradual app release, as well as distribution of pre-release app versions to testers.The Android 3.1 platform (also backported to Android 2.3.4) introduces Android Open Accessory support, which allows external USB hardware (an Android USB accessory) to interact with an Android-powered device in a special accessory mode. When an Android-powered device is in accessory mode, the connected accessory acts as the USB host (powers the bus and enumerates devices) and the Android-powered device acts as the USB device. Android USB accessories are specifically designed to attach to Android-powered devices and adhere to a simple protocol (Android accessory protocol) that allows them to detect Android-powered devices that support accessory mode"
    },
    {
      "_id": "0282e0e58a5c404f5r4te57h89hb98f76ij",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "03",
      "title": "Laravel for Back-end Web Development",
      "balance": "3000",
      "image_url": "https://plana.ae/uploads/2/2020-11/which_company_is_providing_the_best_laravel_development_services_in_the_uae.jpg",
      "details": "Laravel is a web application framework with expressive, elegant syntax. A web framework provides a structure and starting point for creating your application, allowing you to focus on creating something amazing while we sweat the details.Laravel strives to provide an amazing developer experience while providing powerful features such as thorough dependency injection, an expressive database abstraction layer, queues and scheduled jobs, unit and integration testing, and more.Whether you are new to PHP web frameworks or have years of experience, Laravel is a framework that can grow with you. We'll help you take your first steps as a web developer or give you a boost as you take your expertise to the next level. We can't wait to see what you build.There are a variety of tools and frameworks available to you when building a web application. However, we believe Laravel is the best choice for building modern, full-stack web applications.We like to call Laravel a progressive framework. By that, we mean that Laravel grows with you. If you're just taking your first steps into web development, Laravel's vast library of documentation, guides, and video tutorials will help you learn the ropes without becoming overwhelmed.If you're a senior developer, Laravel gives you robust tools for dependency injection, unit testing, queues, real-time events, and more. Laravel is fine-tuned for building professional web applications and ready to handle enterprise work loads."
    },

    {
      "_id": "f69a695f037b65dgiu6v58nbvt568jgd4w89b",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "01",
      "title": "Career Track: Front-End Web Development",
      "balance": "2000",
      "image_url": "https://eww-wp-new.s3.ap-south-1.amazonaws.com/wp-content/uploads/2020/12/23062235/frontend-web-development.jpg",
      "details": "Welcome to our front-end web developer learning pathway! Here we provide you with a structured course that will teach you all you need to know to become a front-end web developer. Work through each section, learning new skills (or improving existing ones) as you go along. Each section includes exercises and assessments to test your understanding before you move forward.You can work through sections in order, but each one is also self-contained. For example, if you already know HTML, you can skip ahead to the CSS section.You don't need any previous knowledge to start this course. All you need is a computer that can run modern web browsers, an internet connection, and a willingness to learn.If you are not sure if front-end web development is for you, and/or you want a gentle introduction before starting a longer and more complete course, work through our Getting started with the web module first.We have tried to make learning front-end web development as comfortable as possible, but you will probably still get stuck because you don't understand something, or some code is just not working.Don't panic. We all get stuck, whether we are beginner or professional web developers. The Learning and getting help article provides you with a series of tips for looking up information and helping yourself. If you are still stuck, feel free to post a question on our Discourse forum.Let's get started. Good luck!"
    },
    {
      "_id": "f69a695f037cd94897rvjguf65uihut5468ft",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "Diversity, Tolerance & Pluralism",
      "balance": "5000",
      "image_url": "https://ieeecsiub.com/wp-content/uploads/2022/06/workshop-on-diversity-and-tolerance.jpg",
      "details": "This Module explores the concepts of diversity, tolerance and pluralism. It examinesways in which the acceptance of diversity may be difficult but can be understood and accomplished  by  drawing  on  ideas and  examples of  ethical  behaviour.  The  Module provides  a  menu  of  options  and  approaches  for  addressing  ethical  challenges involving  issues  of  race,  religious  belief,  gender,  sexual  orientation,  (dis)ability, political  views, and  a  range  of  others.  It  illustrates  the  relevant  concepts  through discussing  historical  social  systems  in  which  tolerance  and  pluralism  were  evident, and  historical  role  models  of  integrity  who  provided  inspirational  leadership  in modelling diversity and acceptance in vexing situations. The Module also discusses moral quandaries in which solutions to a moral dilemma are not clear-cut and require specific  forms  of  ethical  reasoning.  The  discussion  emphasizes  and  explores  the importance  of  diversity  not  only  in  the  context  of  fairness  to  individuals  and The study of diversity, tolerance and pluralism, especially as these relate to culture, race, nationality, religious belief, gender, (dis)ability, and sexual orientation, is a key domain     within     ethics     education     since     issues     such     as     discrimination, misrepresentation   and   ethnocentricity   are   related   to   fairness,   justice,   identity, equality,  and  other ethical  concerns. The  study  of  diversity,  tolerance  and  pluralism not  only  deepens  ourunderstanding  of  the  points  of  view  and  social  contexts  of people from multiple backgrounds and life approaches, but also sensitizes us to the need   to   critically   evaluate   our   assumptions   including   our   stereotypes   about “otherness”  obtained  through  mass  media,  local  bias,  socialization,  and  first-hand exposure. "
    },

    {
      "_id": "11468ed61aee84d9866hbjiy6g75f8j5ev8my",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "03",
      "title": "Back-End Web Development with Node ",
      "balance": "6000",
      "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20220517005132/Why-to-Use-NodeJS-for-Backend-Development.jpg",
      "details": "Node.js is a server-side platform based on the JavaScript Engine in Google Chrome. It was created by Ryan Dahl in 2009, and the most recent version is v0.10.36. This is a cross-platform runtime environment for developing server-side and networking applications that are open source. Node.js programs are written in JavaScript and run on the Node.js runtime on OS X, Microsoft Windows, and Linux. Node.js also comes with a big library of JavaScript modules, which makes developing Node.js web applications much easier. Node js program runs in a single process rather than establishing a new thread for each request. Blocking behavior is the exception rather than the rule in Node.js, because the standard library offers a set of asynchronous I/O primitives that prevent JavaScript code from blocking, and libraries in Node.js are frequently written using non-blocking paradigms. The popularity of Node.js is skyrocketing right now. Netflix, Uber, PayPal, Twitter, and more well-known companies are presently using Node.js. According to StackOverflow's 2021 Developer Survey, Node.js is the 6th most popular technology among programmers, with nearly one-third of professional developers putting it as their first preference.Node.js is sometimes misunderstood by developers as a backend framework that is exclusively used to construct servers. This is not the case; Node.js can be used on the frontend as well as the backend. The event-driven, non-blocking nature of Node.js frameworks is one of the reasons it is a popular choice for developers designing a flexible and scalable backend. "
    },
    {
      "_id": "11468ed61a987jjh689hhcxe09kgs4690myo95g",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "01",
      "title": "Career Track: Full Stack Digital Marketing",
      "balance": "1000",
      "image_url": "https://bongiyo.com/storage/courses/October2020/KIxA6g5Qs5eqseNwKtQU.jpg",
      "details": "Not all digital marketing agencies are built the same way. For one thing, some agencies are much larger or smaller than others, or they offer services to different geographical regions. But another crucial distinction between different agencies is in which services they offer.Some agencies specialize in a particular area of marketing — for example, maybe one agency focuses entirely on designing websites. if you want a comprehensive marketing plan, you can benefit from partnering with an agency that offers full-stack digital marketing services.Full-stack digital marketing is a form of digital marketing that encompasses a wide variety of marketing types rather than focusing on a single strategy. As mentioned above, many companies choose to focus their efforts on one specialty, be it web design or paid ads.Full-stack agencies, however, opt for a “jack-of-all-trades” setup, providing online marketing services across the board.If your business only needs help with one strategy, a single-service agency might be fine. But if you need help with all your online marketing, you’ll want to partner with a full-service agency. Let’s say you need help with your paid advertising and social media. You could go to one agency for paid ads and another for social media, but then you’d have to keep up with two separate agencies that wouldn’t be in sync with one another.A full-service agency, however, could handle both of those strategies.That would enable you to concentrate your attention in one place and synchronize your various campaigns."
    },

    {
      "_id": "2e78e5e0310c2768hutfr467798njhyr547vy6im",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "Google Marketing Tools (Organic)",
      "balance": "1500",
      "image_url": "https://biztattler.com/wp-content/uploads/2019/12/Digital-Marketing-Tools-2020.jpg",
      "details": "Want to get yourself some free advertising on Google? I kid you not -- it's a real thing.All you have to do is claim your Google My Business listing (formerly known as Google Places), and your business can get featured in the search results (as well as in Google Maps) for local searches like the one pictured below. Check it out -- all the businesses within the red call-out in the screenshot below are local Google My Business results for the search mexican restaurant, boston.Best of all, unlike Google AdWords (which we'll touch on later), none of those businesses paid for their positions in these local results.If you haven't already claimed your Google My Business listing, follow the simple steps in this blog post to get your listing up and running. Keep in mind that as Google walks you through the setup of your listing, you'll automatically create a Google+ Page for your business as well, which leads us to our second Google marketing tool With the death of Google Authorship and the elimination of Google +1s from search results, the jury is out about the importance of maintaining an active Google+ Business Page these days if you're not a local business. That said, given Google's massive empire, we think it behooves all businesses to play it safe and create a Google+ Page, even if you only update it every so often. To create a page, get started here. But if you're a local business, setting up and maintaining a Google+ Page goes hand in hand with your Google My Business listing (see above), making Google+ even more critical for you. And considering your Google My Business listing will include a link to your business' Google+ Page, it's important to take some extra time to make your page the best it can be.Learn more about how to optimize your Google+ Page in this free ebook, and you can check out HubSpot's own Google+ Page here."
    },

    {
      "_id": "a713ee936ff5574273uy4tt7rn8uf0f769f5c5b20e",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "03",
      "title": "PHP for Web Development",
      "balance": "7000",
      "image_url": "https://unidad22.com/wp-content/uploads/2017/01/web-deve-php.jpg",
      "details": "PHP is a common open-source scripting language popular for web applications. Although it originally stood for “personal home page,” PHP is now a recursive acronym for “hypertext preprocessor” — but chances are you’ll never hear that name again. its simplest form, PHP is a server-side scripting language that is embedded in HTML. PHP allows web developers to create dynamic content and to interact with databases. PHP is known for its simplicity, speed, and flexibility — features which have made it a cornerstone in the web development world. is used by 79.1% of all websites with known server-side programming, and its use has been on the rise in the last decade, up from 72% in 2010. PHP is used on some of the largest web properties and platforms including Facebook, Wikipedia, WordPress, and Zoom.Like any other scripting language, PHP is fundamentally the tool you use both to connect to your database to get information and to hand that information over to your web server to be displayed in HTML. But there are many aspects of PHP that set it apart from other languages.PHP is a loosely-typed language that uses a total of eight data types used to construct variables (which store data of different types). Unlike other programming languages, PHP is quite relaxed when it comes to variables, evaluating and guessing the data type. All variables have a dollar sign ($) to start, but can be named anything that begins with a letter. "
    },

    {
      "_id": "e342b6c0c8efc8ca9e81tdui1gu9i91dc8a790hg0",
      "others_info": {
        "is_todays_pick": true,
        "is_trending": false
      },
      "category_id": "04",
      "title": "Introduction to Database",
      "balance": "5000",
      "image_url": "https://knowthecode.io/wp-content/uploads/2016/10/Introduction-to-Database.png",
      "details": "In simple words, data can be facts related to any object in consideration. For example, your name, age, height, weight, etc. are some data related to you. A picture, image, file, pdf, etc. can also be considered data.A database is a systematic collection of data. They support electronic storage and manipulation of data. Databases make data management easy. Let us discuss a database example: An online telephone directory uses a database to store data of people, phone numbers, and other contact details. Your electricity service provider uses a database to manage billing, client-related issues, handle fault data, etc.Let us also consider Facebook. It needs to store, manipulate, and present data related to members, their friends, member activities, messages, advertisements, and a lot more. We can provide a countless number of examples for the usage of databases.A distributed database is a type of database that has contributions from the common database and information captured by local computers. In this type of database system, the data is not in one place and is distributed at various organizations.This type of database defines database relationships in the form of tables. It is also called Relational DBMS, which is the most popular DBMS type in the market. Database example of the RDBMS system include MySQL, Oracle, and Microsoft SQL Server database.This type of computers database supports the storage of all data types. The data is stored in the form of objects. The objects to be held in the database have attributes and methods that define what to do with the data. PostgreSQL is an example of an object-oriented relational DBMS."
    },
    {
      "_id": "e342b6c0c8efc8ca9e753jgehvtrje811991dc8a7901",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "04",
      "title": "MATLAB Masterclass",
      "balance": "4000",
      "image_url": "https://www.pantechsolutions.net/wp-content/uploads/2012/09/Getting-started-with-Matlab-640x358.png",
      "details": "MATLAB (an abbreviation of MATrix LABoratory is a proprietary multi-paradigm programming language and numeric computing environment developed by MathWorks. MATLAB allows matrix manipulations, plotting of functions and data, implementation of algorithms, creation of user interfaces, and interfacing with programs written in other languages. MATLAB is intended primarily for numeric computing, an optional toolbox uses the MuPAD symbolic engine allowing access to symbolic computing abilities. An additional package, Simulink, adds graphical multi-domain simulation and model-based design for dynamic and embedded systems.As of 2020, MATLAB has more than 4 million users worldwide.[23] They come from various backgrounds of engineering, science, and economics.MATLAB was invented by mathematician and computer programmer Cleve Moler.[24] The idea for MATLAB was based on his 1960s PhD thesis.[24] Moler became a math professor at the University of New Mexico and started developing MATLAB for his students[24] as a hobby.[25] He developed MATLAB's initial linear algebra programming in 1967 with his one-time thesis advisor, George Forsythe.[24] This was followed by Fortran code for linear equations in 1971.In the beginning (before version 1.0) MATLAB was not a programming language; it was a simple interactive matrix calculator. There were no programs, no toolboxes, no graphics. And no ODEs or FFTs. first early version of MATLAB was completed in the late 1970s.[24] The software was disclosed to the public for the first time in February 1979 at the Naval Postgraduate School in California.[25] Early versions of MATLAB were simple matrix calculators with 71 pre-built functions.[27] At the time, MATLAB was distributed for free[28][29] to universities.[30] Moler would leave copies at universities he visited and the software developed a strong following in the math departments of university campuses. the 1980s, Cleve Moler met John N. Little. They decided to reprogram MATLAB in C and market it for the IBM desktops that were replacing mainframe computers at the time.[24] John Little and programmer Steve Bangert re-programmed MATLAB in C, created the MATLAB programming language, and developed features for toolboxes."
    },

    {
      "_id": "f06f8cc035b04bty5e65njhvtrd1158e4198281915a3",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "05",
      "title": "Stata for Statistics & Data Analysis",
      "balance": "8000",
      "image_url": "https://www.stata.com/includes/images/stata-fb.jpg",
      "details": "Stata  STAY-ta, alternatively , occasionally stylized as STATA is a general-purpose statistical software package developed by StataCorp for data manipulation, visualization, statistics, and automated reporting. It is used by researchers in many fields, including biomedicine, epidemiology, sociology and science.Stata was initially developed by Computing Resource Center in California and the first version was released in 1985. In 1993, the company moved to College Station, TX and was renamed Stata Corporation, now known as StataCorp.A major release in 2003 included a new graphics system and dialog boxes for all commands.[6] Since then, a new version has been released once every two years. The current version is Stata 17, released in April 2021.Until the release of version 16,Stata could only open a single dataset at any one time. Stata allows for flexibility with assigning data types to data. Its compress command automatically reassigns data to data types that take up less memory without loss of information. Stata utilizes integer storage types which occupy only one or two bytes rather than four, and single-precision (4 bytes) rather than double-precision (8 bytes) is the default for floating-point numbers.Stata's data format is always tabular in format. Stata refers to the columns of tabular data as variables. From its creation, Stata has always employed an integrated command-line interface. Starting with version 8.0, Stata has included a graphical user interface based on Qt framework which uses menus and dialog boxes to give access to many built-in commands. The dataset can be viewed or edited in spreadsheet format. From version 11 on, other commands can be executed while the data browser or editor is opened. "
    },
    {
      "_id": "f06f8cc035b04bghh54787ybhre4d1158e4198281915a4",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "05",
      "title": "Macros & VBA for Excel Automation",
      "balance": "4500",
      "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSS1G7T2MPINgd9YVSu1dZuiHnETOxuZfd3Ig&usqp=CAU",
      "details": "VBA Macros use the Visual Basic Application in Excel to create custom user-generated functions and speed up manual tasks by creating automated processes.  Additionally, VBA can be used to access the Windows Application Programming Interface (API).  One of its main uses is to change and customize the user interface by creating personalized toolbars, menus, dialog boxes, and forms.In a separate article, CFI discusses what VBA is and how to access the VBA Editor. As a summary, pressing Alt + F11 in Excel opens up the VBA window and allows the user to begin coding macros. start coding, the user will have to create a Module file. Module files contain a group of macros. To create a new module, press Insert > Module. Optionally, the user can name this module using the properties window in the bottom left corner of the editor. Simply type in a new module name and press enter.To start off, the macro must be given a unique name. This name cannot match other macros, and it usually cannot match the name of other properties, functions, and tools within Excel. The macro name is what the user will use to call the macro into action. define a macro name, the user must type Sub name() and press “enter” in the coding window of the editor. Pressing enter will automatically fill the window with the general format of an Excel macro. For example, to name the macro “CFI Macro”, a user should type “Sub cfiMacro()” and press enter. The VBA Editor will automatically add an “End Sub” line a few lines below the “Sub”.Note: The general convention for typing names for any macro, function, or variable in VBA is to use lower case if there is only one word, and to use an uppercase letter at the start of every new word. VBA names generally cannot contain spaces. Since CFI Macro is two words, this should be written as cfiMacro. However, these are just best practice guidelines and need not necessarily be adhered to.The Sub Name() line tells the editor the start of the macro code. The End Sub denotes the end. If the user wanted to, he or she could create a second new macro by starting a new Sub Name() line below the first End Sub. Try this out and you should notice that Excel will automatically create a line between the two different macros."
    },

    {
      "_id": "cd2b53655737chy568bjft54iiu7c4077542baea9f8f75d",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "Google Ads Complete Course: A to Z",
      "balance": "1200",
      "image_url": "https://i.ytimg.com/vi/YkDXgJLpLVI/maxresdefault.jpg",
      "details": "Google Ads is an advertising program through Google that allows you to attract traffic to your site by placing advertisements online. Google Ads lets you determine where you want your advertisements to be displayed and is scalable, making the platform accessible for any budget. Through Google Ads and a good SEO marketing strategy, you can increase traffic to your website, improve sales, and build your brand awareness.Google Ads (formerly called Google Adwords) is a digital advertising platform where businesses can bid money on relevant keywords to display advertisements for their products and services on online channels. The online advertisements appear as sponsored results on Google search engine result pages or display ads on websites and mobile apps in Google’s Network. The platform assigns each ad a page position based on the bid's size combined with the advertisement’s quality (determined by Google’s Quality Score metric). The business then pays via a Cost Per Click (CPC) model for the number of clicks the ad receives. Within the Google Ads platform, businesses can view their online ads' metrics and performance, set goals for their advertising efforts, and set audience targeting parameters.The free Google Ads Fundamentals course takes you from the Google Ads basics to advanced concepts. Understand how to conduct different Google Ads campaign experiments using various Google Ads tools. Learn how to distinguish between opportunities available for organic & paid listings. By the end of the course, you will learn how to drive more sales for your business using the Google Ads platform."
    },
    {
      "_id": "2e78e5e0310c76780njkjgv54t2e9adbb6efb1a263e745",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "06",
      "title": "Google Marketing Tools (Organic)",
      "balance": "2000",
      "image_url": "https://biztattler.com/wp-content/uploads/2019/12/Digital-Marketing-Tools-2020.jpg",
      "details": "Introducing Google Marketing Platform, a unified advertising and analytics platform for smarter marketing and better results.Google is quite disputed be search marketers all over the world but we can all agree on one thing: Google offers lots of tools and features which can help every business, big or small, to thrive and make the most of their activity. From developer tools to business management and valuable resources, here it is – what we hope to be – the complete list of Google marketing tools. We’ve scooped the whole internet to find the most useful and relevant Google tools for everyone who wants to create a good and powerful marketing strategy and a successful business. Here we go. Google Ads (former Google AdWords) is an optional tool that you can use to create advertising campaigns on Google Search, Youtube, Mobile Apps or remarketing on third-party websites. Google Ads is an advertising tool, that works on a bidding strategy. When you create a campaign, you’re allowed to add a landing page and create brief advertisements, service offerings, product listings, video content and generate mobile application installs. You can choose out of three pricing models, based on the type you’d like to use. The first two pricing models are available for paid search, and the last one can be available only for Display Network campaigns (a large resource of websites, videos, and apps where your ads can appear).Google Keyword Planner is an important feature from the Google Ads tools. You can use it independently, no matter if you pay or not. There’s a catch though. If you have active campaigns, you’ll get more information comparing to a non-paid account."
    },
    {
      "_id": "4e6092d54c18u67hvjb754iuh7fbd89ad59e88a1e87fbb",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "07",
      "title": "Graphic Design Fundamentals",
      "balance": "7000",
      "image_url": "https://static.skillshare.com/uploads/parentClasses/0ac06f345f4b6698a28d97274bcfcca6/8aedba3b",
      "details": "You don’t need a degree in graphic design to create amazing graphics. You just need to understand some basic graphic design fundamentals. That’s what we’re going to review in this article.Color is a critical element to get right in your designs. It’s used to attract attention, convey meaning, and of course for aesthetics. We don’t usually even think about the colors we look at; we judge things quickly and often measure instantly whether something is desirable, professional, nice, ugly, or even weird based upon its color.The most important thing to think about using colors is the contrast between them. Contrast refers to how well one color stands out from another. You can use contrasting colors within an image to make text stand out from its background for example. Complementary colors, like yellow and purple, or blue and orange, for instance, provide maximum contrast with one another. Contrast can also be used to guide people’s actions; to let people know what you want them to do. If you want to increase ‘click-through,’ make sure that there’s a strong contrast between the call-to-action button and the rest of the design.You can check how colors contrast using a color wheel. A color wheel shows how colors are related visually. For example, complementary colors are those opposite one another on the color wh Colors also give visual cues meaning. For example, a green button usually indicates an affirmative action, like ‘OK’ or ‘Accept.’ But if you were to design a large ‘Accept’ button and make it red, it could really confuse the user, and in some cases, the results could be disastrous.We’ve seen that images lend themselves very well to digital media, but there are some general points to consider. Firstly, audiences respond well to images with people in them. It helps create an emotional connection as campaigns are targeted at real people and your imagery needs to reflect that.Image quality is also very important. When customers are considering a purchase online, they want to be able to scrutinize images that give a high level of detail of the product. People often abandon an ecommerce site because the product image is not of a high enough quality to help them make a decision. It negatively affects their impression of the product and you can lose the sale.So when you choose images as part of a design, make sure that your images are high definition, or HD, and are appropriate to the device your audience will use. They should not be stretched or pixelated.Next, remember that most web traffic comes from a mobile device – so it’s very important that you test your graphics on mobile to make sure they still look okay on smaller dimensions. If not, consider creating a separate version of your graphic specifically to show to people who are using mobile devices."
    },
    {
      "_id": "7c4dfea0fafddc8ytr5vbutyruiu13673282a428429b7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "01",
      "title": "Career Track: Full Stack (MERN) Web Development with ",
      "balance": "6000",
      "image_url": "https://www.rlogical.com/wp-content/uploads/2020/12/MERN-Stack-considered-the-Best-for-Developing-Web-Apps.png",
      "details": "MERN is one of several variations of the MEAN stack (MongoDB Express Angular Node), where the traditional Angular.js front-end framework is replaced with React.js. Other variants include MEVN (MongoDB, Express, Vue, Node), and really any front-end JavaScript framework can work.Ready to take the next step? Set up your free Atlas account by clicking below and try our MERN Stack Tutorial to create a full-stack MERN application in no time.Express and Node make up the middle (application) tier. Express.js is a server-side web framework, and Node.js is the popular and powerful JavaScript server platform. Regardless of which variant you choose, ME(RVA)N is the ideal approach to working with JavaScript and JSON, all the way through.The MERN architecture allows you to easily construct a three-tier architecture (front end, back end, database) entirely using JavaScript and JSON.The top tier of the MERN stack is React.js, the declarative JavaScript framework for creating dynamic client-side applications in HTML. React lets you build up complex interfaces through simple components, connect them to data on your back-end server, and render them as HTML. strong suit is handling stateful, data-driven interfaces with minimal code and minimal pain, and it has all the bells and whistles you’d expect from a modern web framework: great support for forms, error handling, events, lists, and more. The next level down is the Express.js server-side framework, running inside a Node.js server. Express.js bills itself as a “fast, unopinionated, minimalist web framework for Node.js,” and that is indeed exactly what it is. Express.js has powerful models for URL routing (matching an incoming URL with a server function), and handling HTTP requests and responses. making XML HTTP Requests (XHRs) or GETs or POSTs from your React.js front end, you can connect to Express.js functions that power your application. Those functions, in turn, use MongoDB’s Node.js drivers, either via callbacks or using promises, to access and update data in your MongoDB database."
    },
    {
      "_id": "30af81e91ab3eyf5ehbj8757hafc0bcae0de62f55d5c",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "C Programming for Beginners",
      "balance": "5000",
      "image_url": "https://i.pinimg.com/736x/ec/29/74/ec2974b3e78fcbb2600af2e61c3c7b8d.jpg",
      "details": "C is a powerful general-purpose programming language. It can be used to develop software like operating systems, databases, compilers, and so on. C programming is an excellent language to learn to program for beginners. C tutorials will guide you to learn C programming one step at a time.C is a general-purpose programming language created by Dennis Ritchie at the Bell Laboratories in 1972. is a very popular language, despite being old. is strongly associated with UNIX, as it was developed to write the UNIX operating system.C helps you to understand the internal architecture of a computer, how computer stores and retrieves information. learning C, it will be much easier to learn other programming languages like Java, Python, etc.Opportunity to work on open source projects. Some of the largest open-source projects such as Linux kernel, Python interpreter, SQLite database, etc. are written in C programming.C is one of the most efficient programming languages used in modern web browsers, operating systems, compilers, and many more. Learn to code in C Programming in the most interactive way possible, writing code and solving challenges in each step.It is one of the most popular programming language in the worldIf you know C, you will have no problem learning other popular programming languages such as Java, Python, C++, C#, etc, as the syntax is similarC is very fast, compared to other programming languages, like Java and Python C is very versatile; it can be used in both applications and technologies. C++ was developed as an extension of C, and both languages have almost the same syntax  main difference between C and C++ is that C++ support classes and objects, while C does not"
    },
    {
      "_id": "df11ff9feefc37613cc3a448ohvh65fdcru66ce02151",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "06",
      "title": "YouTube Marketing for Organic Reach",
      "balance": "4000",
      "image_url": "https://www.seoclerk.com/pics/000/471/823/3152ecbfb0a7a7db11d4f45c95b6390f.png",
      "details": "Let’s talk about YouTube. Chances are we’ve all spent a wasted afternoon watching one silly cat video after another. has always been a source of entertaining content, but it’s also staking its claim as an essential tool for marketers. In fact, more than half of all marketers (55%) use YouTube as part of their marketing strategy.  may be thinking: That’s great, but my audience isn’t on YouTube. Well, think again.One-quarter of internet users spend 10 hours or more watching videos, and YouTube has more than two billion active users worldwide. The platform is so extensive that it can be accessed in 76 different languages. In this new guide you’ll learn everything you need to know about starting — and growing — a YouTube channel from scratch. video production to SEO, this guide has everything you need to get started with YouTube Marketing.YouTube Marketing is the practice of promoting businesses and products on YouTube’s platform, by uploading valuable videos on a company’s YouTube channel or using YouTube ads.Simply put: YouTube (and video in general) is already huge. And it’s getting bigger by the day. Not only is your audience on YouTube, but as the internet’s second largest search engine, YouTube can help improve your SEO and overall brand presence. YouTube allows marketers to present unique content that's easy for viewers to consume and share. marketing can be an intimidating tool for brands. It combines a strategic principle — SEO — with one of the most resource-intensive forms of media — video. That’s why we’ve created this complete guide for YouTube pros and newcomers alike. Below we’ll walk through each step of marketing on YouTube — from how to create a YouTube channel and optimize videos for SEO to how to run a YouTube advertising campaign and interpret video analytics. along, bookmark it for later, or jump to the section that interests you most. So, you’ve decided to create a YouTube channel. Great! Now, you’ll need a YouTube Marketing strategy to help you identify goals, decide on video topics, and properly promote your brand on your new channel. Before we dive in, it’s important to note that maintaining a YouTube channel takes a lot of time and planning. Are you ready for it? Unlike other social networking platforms, YouTube exclusively hosts video content. You’ll need to set aside time to plan, film, edit, market, and analyze your content on a consistent basis. You’ll also need to define your brand’s goals and plan for how video can specifically help you achieve these. If you can devote an appropriate amount of time and energy to the platform, you’ll be able to create engaging, shareable content for your growing audience."
    },
    {
      "_id": "919db97c34e0778bht6ej876thuy76bu6387dd40cdfa081",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "Graphic Design Fundamentals",
      "balance": "3000",
      "image_url": "https://static.skillshare.com/uploads/parentClasses/0ac06f345f4b6698a28d97274bcfcca6/8aedba3b",
      "details": "You don’t need a degree in graphic design to create amazing graphics. You just need to understand some basic graphic design fundamentals. That’s what we’re going to review in this article.Color is a critical element to get right in your designs. It’s used to attract attention, convey meaning, and of course for aesthetics. We don’t usually even think about the colors we look at; we judge things quickly and often measure instantly whether something is desirable, professional, nice, ugly, or even weird based upon its color.The most important thing to think about using colors is the contrast between them. Contrast refers to how well one color stands out from another. You can use contrasting colors within an image to make text stand out from its background for example. Complementary colors, like yellow and purple, or blue and orange, for instance, provide maximum contrast with one another. Contrast can also be used to guide people’s actions; to let people know what you want them to do. If you want to increase ‘click-through,’ make sure that there’s a strong contrast between the call-to-action button and the rest of the design.You can check how colors contrast using a color wheel. A color wheel shows how colors are related visually. For example, complementary colors are those opposite one another on the color wh Colors also give visual cues meaning. For example, a green button usually indicates an affirmative action, like ‘OK’ or ‘Accept.’ But if you were to design a large ‘Accept’ button and make it red, it could really confuse the user, and in some cases, the results could be disastrous.We’ve seen that images lend themselves very well to digital media, but there are some general points to consider. Firstly, audiences respond well to images with people in them. It helps create an emotional connection as campaigns are targeted at real people and your imagery needs to reflect that.Image quality is also very important. When customers are considering a purchase online, they want to be able to scrutinize images that give a high level of detail of the product. People often abandon an ecommerce site because the product image is not of a high enough quality to help them make a decision. It negatively affects their impression of the product and you can lose the sale.So when you choose images as part of a design, make sure that your images are high definition, or HD, and are appropriate to the device your audience will use. They should not be stretched or pixelated.Next, remember that most web traffic comes from a mobile device – so it’s very important that you test your graphics on mobile to make sure they still look okay on smaller dimensions. If not, consider creating a separate version of your graphic specifically to show to people who are using mobile devices."
    },
    {
      "_id": "374df11ae3d9b8b9ce21f4dc53f59b85kby7juftki7j",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "iOS App Development with Swift",
      "balance": "2000",
      "image_url": "https://patelecomnet.com/wp-content/uploads/2018/09/swift-for-ios-development.png",
      "details": "The powerful programming language that is also easy to learn. Swift is a powerful and intuitive programming language for iOS, iPadOS, macOS, tvOS, and watchOS. Writing Swift code is interactive and fun, the syntax is concise yet expressive, and Swift includes modern features developers love. Swift code is safe by design and produces software that runs lightning-fast. Swift is the result of the latest research on programming languages, combined with decades of experience building Apple platforms. Named parameters are expressed in a clean syntax that makes APIs in Swift even easier to read and maintain. Even better, you don’t even need to type semi-colons. Inferred types make code cleaner and less prone to mistakes, while modules eliminate headers and provide namespaces. To best support international languages and emoji, Strings are Unicode-correct and use a UTF-8 based encoding to optimize performance for a wide-variety of use cases. Memory is managed automatically using tight, deterministic reference counting, keeping memory usage to a minimum without the overhead of garbage collection. You can even write concurrent code with simple, built-in keywords that define asynchronous behavior, making your code more readable and less error-prone. Swift eliminates entire classes of unsafe code. Variables are always initialized before use, arrays and integers are checked for overflow, memory is automatically managed, and enforcement of exclusive access to memory guards against many programming mistakes. Syntax is tuned to make it easy to define your intent — for example, simple three-character keywords define a variable ( var ) or constant ( let ). And Swift heavily leverages value types, especially for commonly used types like Arrays and Dictionaries. This means that when you make a copy of something with that type, you know it won’t be modified elsewhere."
    },
    {
      "_id": "acb9b6785b62698fc6130dnbvyt78jgb7615965e1hy7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "03",
      "title": "React & Redux For Front End Web Development",
      "balance": "1000",
      "image_url": "https://fiverr-res.cloudinary.com/images/q_auto,f_auto/gigs/188714149/original/2c4300e1fa835fea0cb0c7af4d8fdaef82e23fa2/develop-frontend-using-reactjs-redux-bootstrap-material-ui-ant-design.png",
      "details": "This course explores Javascript based front-end application development, and in particular the React library (Currently Ver. 16.3). This course will use JavaScript ES6 for developing React application. You will also get an introduction to the use of Reactstrap for Bootstrap 4-based responsive UI design. You will be introduced to various aspects of React components. You will learn about React router and its use in developing single-page applications. You will also learn about designing controlled forms. You will be introduced to the Flux architecture and Redux. You will explore various aspects of Redux and use it to develop React-Redux powered applications. You will then learn to use Fetch for client-server communication and the use of REST API on the server side. A quick tour through React animation support and testing rounds off the course. You must have preferably completed the previous course in the specialization on Bootstrap 4, or have a working knowledge of Bootstrap 4 to be able to navigate this course. Also a good working knowledge of JavaScript, especially ES 5 is strongly recommended.At the end of this course you will: Be familiar with client-side Javascript application development and the React library Be able to implement single page applications in React  Be able to use various React features including components and forms Be able to implement a functional front-end web application using React Be able to use Reactstrap for designing responsive React applications Be able to use Redux to design the architecture for a React-Redux application. In this module you will explore Redux further including Redux action, combining reducers, and Redux thunk, client-server communication using Fetch and the REST API. You will get a brief introduction to animation in React. You will also learn about testing, building and deploying React applications."
    },
    {
      "_id": "be44c843d61859cc0b87cae85c55f9db86vjbu879",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "06",
      "title": "React Native for Multiplatform App ",
      "balance": "8000",
      "image_url": "https://media-exp1.licdn.com/dms/image/C5112AQHRtJV3Q2PTRw/article-cover_image-shrink_600_2000/0/1579870089480?e=2147483647&v=beta&t=Ge-DB0naXVhHRh5dz4Eb6Agjyd89cOysPyM5lJfmVAk",
      "details": "Create native apps for Android and iOS using React . React Native combines the best parts of native development with React, a best-in-class JavaScript library for building user interfaces. a little—or a lot. You can use React Native today in your existing Android and iOS projects or you can create a whole new app from scratch. Written in JavaScript—rendered with native code primitives render to native platform UI, meaning your app uses the same native platform APIs other apps do.Many platforms, one React. Create platform-specific versions of components so a single codebase can share code across platforms. With React Native, one team can maintain two platforms and share a common technology—React. See your changes as soon as you save. With the power of JavaScript, React Native lets you iterate at lightning speed. No more waiting for native builds to finish. Save, see, repeat. React Native has emerged as the most popular framework for building hybrid mobile apps with JavaScript and is currently used by companies like Airbnb, Tesla, Facebook, and many more. There are many reasons why business owners and developers should consider using React Native for their cross-platform mobile app development needs.The latest online survey also showcases React Native’s massive popularity worldwide. Today, it has one of the most loved frameworks worldwide, with a gigantic 85.6% satisfaction rate compared to other frameworks. So, what’s so unique about React Native, making it such a widely accepted framework? Let’s explore the key reasons in detail and know more about this popular framework. we go…"
    },
    {
      "_id": "1b03149c50f1bec662062d930bf46489ngy56injy7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "title": "Advanced JAVA Programming for ",
      "balance": "7000",
      "image_url": "https://www.snti.in/images/advjava-card.png",
      "details": "The dictionary meaning of advance is a forward movement or a development or improvement and the meaning of improve means thing that makes something better. All in all, we have to improve our basic knowledge to master in that particular field.Java is divided into two parts i.e. Core Java (J2SE) and Advanced Java (JEE). The core Java part covers the fundamentals (data types, functions, operators, loops, thread, exception handling, etc.) of the Java programming language. It is used to develop general purpose applications. Whereas Advanced Java covers the standard concepts such as database connectivity, networking, Servlet, web-services, etc. In this section, we will discuss what is advance Java, its benefit, uses, topics of advance Java, and the difference between core Java and advance Java.It is a part of Java programming language. It is an advanced technology or advance version of Java specially designed to develop web-based, network-centric or enterprise applications. It includes the concepts like Servlet, JSP, JDBC, RMI, Socket programming, etc. It is a specialization in specific domain. of the applications developed using advance Java uses tow-tier architecture i.e. Client and Server. All the applications that runs on Server can be considered as advance Java applications.The four major benefits of advance Java that are, network centric, process simplification, and futuristic imaging standard. (advance Java) provides libraries to understand the concept of Client-Server architecture for web- based applications. can also work with web and application servers such as Apache Tomcat and Glassfish Using these servers, we can understand the working of HTTP protocol. It cannot be done in core Java.It is also important understand the advance Java if you are dealing with trading technologies like Hadoop, cloud-native and data science.It provides a set of services, API and protocols, that provides the functionality which is necessary for developing multi-tiered application, web-based application.There is a number of advance Java frameworks like, Spring, Hibernate, Struts, that enables us to develop secure transaction-based web applications such as banking application, inventory management application."
    },
    {
      "_id": "7f5b80c1cdd4df0111918883eae07349ngcfe4uie",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "03",
      "title": "Complete HTML5, CSS3 & Bootstrap 4",
      "balance": "6000",
      "image_url": "https://www.fivesquid.com/pics/t2/1524759201-87781-1-1.jpg",
      "details": "Having a good grasp of HTML means you'll be able to create, present and edit a whole variety of content on the web. CSS3. CSS (Cascading Style Sheets) essentially 'enhances' HTML, giving developers and users more control over how pages and content is displayed.Cascading Style Sheets, or CSS, is a style sheet language that can be used alongside HTML5.For an average learner with a good degree of discipline, it should take around seven to eight months to build up a working knowledge of CSS (and HTML—as they are almost inseparable). At the one-year mark, you'll have built up more confidence. A fun way to push yourself is to start a small creative project of your own.Developers today combine JavaScript, HTML5 and CSS3 to create web pages that look good across devices, platforms and browsers. HTML5 will provide a suitable format to your website; JavaScript helps developers to make dynamic, interactive WebPages and CSS3 polishes the design even further. Powerful, extensible, and feature-packed frontend toolkit. Build and customize with Sass, utilize prebuilt grid system and components, and bring projects to life with powerful JavaScript plugins. Jump right into building with Bootstrap—use the CDN, install it via package manager, or download the source code.Install Bootstrap’s source Sass and JavaScript files via npm, RubyGems, Composer, or Meteor. Package managed installs don’t include documentation or our full build scripts. You can also use our npm template repo to quickly generate a Bootstrap project via npm. When you only need to include Bootstrap’s compiled CSS or JS, you can use jsDelivr. See it in action with our simple quick start, or browse the examples to jumpstart your next project. You can also choose to include Popper and our JS separately. New in Bootstrap 5, our utilities are now generated by our Utility API. We built it as a feature-packed Sass map that can be quickly and easily customized. It's never been easier to add, remove, or modify any utility classes. Make utilities responsive, add pseudo-class variants, and give them custom names.  "
    },
    {
      "_id": "7f5b80c1cdd4df0111918883eae0735jt7ogre4re40",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "06",
      "title": "Facebook Ads: A to Z",
      "balance": "5000",
      "image_url": "https://pijushsaha.com/courses/public/medies/Mar_2021/1615921100.6050ffcc4a8c4.jpg",
      "details": "You don't have to be an expert to start advertising on Facebook. Create and run campaigns using simple self-serve tools, and track their performance with easy-to-read reports. More than two billion people use Facebook every month – so no matter what kind of audience you want to reach, you'll find them here.To choose the right ad objective, answer the question what's the most important outcome I want from this ad? It could be sales on your website, downloads of your app or increased brand awareness.Using what you know about the people you want to reach – such as age, location and other details – choose the demographics, interests and behaviours that best represent your audience.Next, choose where you want to run your ad – whether that's on Facebook, Instagram, Messenger, Audience Network or across them all. In this step, you can also choose to run ads on specific mobile devices.Enter your daily or lifetime budget, and the time period during which you want your ads to run. These limits mean that you'll never spend more than you're comfortable with. Choose from six versatile ad formats – they're designed to work on every device and connection speed. You can choose to show a single image or video in your ad, or use a roomier, multi-image format.With a few clicks, you can run ads across Facebook, Instagram, Audience Network and Messenger. By making a single campaign, you can reach people on all of their favourite apps and websites.Show your ads on whatever device your audience happens to be using, with additional options for mobile or desktop.Advertising across platforms and devices is easy. Just build your ad once, then select automatic placements to run your ad in the places that are most likely to achieve your marketing goals. No resizing or reformatting required.Start by considering your tone of voice, which can simply be a reflection of your business's personality. Is it funny? All business? Adventurous? The more authentic you are, the more effective your ads are likely to be."
    },
    {
      "_id": "17d266b79d2fcd850cd4d983c3aeb95fbftruu7854bgr",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "07",
      "title": "Mapping and Spatial Analysis with ArcGIS",
      "balance": "4000",
      "image_url": "https://s3.amazonaws.com/coursera_assets/meta_images/generated/XDP/XDP~SPECIALIZATION!~gis-mapping-spatial-analysis/XDP~SPECIALIZATION!~gis-mapping-spatial-analysis.jpeg",
      "details": "Spatial analysis allows you to solve complex location-oriented problems, explore and understand your data from a geographic perspective, determine relationships, detect and quantify patterns, assess trends, and make predictions and decisions. Spatial analysis goes beyond mapping and allows you to study the characteristics of places and the relationships among them. Spatial analysis lends new perspectives to your decision-making.Using spatial analysis, you can combine information from many sources and derive new information by applying a set of spatial operators. This collection of spatial analysis tools allows you to answer complex spatial questions. Statistical analysis can determine whether the patterns that you see are significant. You can analyze various layers to calculate the suitability of a place for a particular activity and, using image analysis, you can detect change over time. These tools allow you to address important questions and decisions that are beyond the scope of simple visual analysis. Using data engineering, you can explore, visualize, clean, and prepare your data. The data engineering process is a common first step for many spatial analysis and mapping workflows. The Data Engineering view and ribbon can help you better understand your data and prepare it for GIS workflows.Visualizing data using charts can uncover data patterns, trends, relationships, and structures that may otherwise be difficult to see as raw numbers in a table. Interpret the results of your analysis and communicate the findings with charts. Machine learning refers to a set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning is an important subset of machine learning techniques that uses artificial neural networks to learn from data. Machine learning and deep learning can play a critical role in spatial problem solving in a wide range of application areas, from image classification to spatial pattern detection to multivariate prediction.In addition to traditional machine learning techniques, ArcGIS Pro has a subset of machine learning techniques that are inherently spatial. These spatial methods that incorporate some notion of geography directly into their computation can lead to deeper understanding. The spatial component often takes the form of some measure of shape, density, contiguity, spatial distribution, or proximity. Both traditional and inherently spatial machine learning can play an important role in solving spatial problems, and ArcGIS Pro supports their use in a number of ways.Machine learning can be computationally intensive and often involves large and complex data. Advancements in data storage and both parallel and distributed computing make solving problems at the intersection of machine learning and GIS increasingly possible."
    },
    {
      "_id": "61f9ce168f7b15aadecb1d1fc80c72f0gtbu6r447iu7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "05",
      "title": "SQL For Data Science",
      "balance": "3000",
      "image_url": "https://i.ytimg.com/vi/sTiWTx0ifaM/maxresdefault.jpg",
      "details": "SQL (Structured Query Language) is a programming language designed for managing data in a relational database. It's been around since the 1970s and is the most common method of accessing data in databases today. SQL has a variety of functions that allow its users to read, manipulate, and change data. Though SQL is commonly used by engineers in software development, it's also popular with data analysts for a few reasons . This tutorial is designed for people who want to answer questions with data. For many, SQL is the meat and potatoes of data analysis—it's used for accessing, cleaning, and analyzing data that's stored in databases. It's very easy to learn, yet it's employed by the world's largest companies to solve incredibly challenging problems.n particular, this tutorial is meant for aspiring analysts who have used Excel a little bit but have no coding experience.Though some of the lessons may be useful for software developers using SQL in their applications, this tutorial doesn't cover how to set up SQL databases or how to use them in software applications—it is not a comprehensive resource for aspiring software developers.The entire tutorial is meant to be completed using Mode, an analytics platform that brings together a SQL editor, Python notebook, and data visualization builder. You should open up another browser window to Mode. You'll retain the most information if you run the example queries and try to understand results, and complete the practice exercises.Note: You will need to have a Mode user account in order to start the tutorial. You can sign up for one at mode.com.SQL is great for performing the types of aggregations that you might normally do in an Excel pivot table—sums, counts, minimums and maximums, etc.—but over much larger datasets and on multiple tables at the same time.There are many ways to organize a database and many different types of databases designed for different purposes. Mode's structure is fairly simple: If you've used Excel, you should already be familiar with tables—they're similar to spreadsheets. Tables have rows and columns just like Excel, but are a little more rigid. Database tables, for instance, are always organized by column, and each column must have a unique name. To"
    },
    {
      "_id": "61f9ce168f7b15aadecb1d1fc80c72f7nbcgr579bhr57",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "04",
      "title": "Data Structures And Algorithms",
      "balance": "2000",
      "image_url": "https://www.synergisticit.com/wp-content/uploads/2020/09/How-Data-Structures-and-Algorithms-are-important-for-Computer-Science-Graduates.jpg",
      "details": " A computer program is a collection of instructions to perform a specific task. For this, a computer program may need to store data, retrieve data, and perform computations on the data.A data structure is a named location that can be used to store and organize data. And, an algorithm is a collection of steps to solve a particular problem. Learning data structures and algorithms allow us to write efficient and optimized computer programs.Our DSA tutorial will guide you to learn different types of data structures and algorithms and their implementations in Python, C, C++, and Java.A computer program is a collection of instructions to perform a specific task. For this, a computer program may need to store data, retrieve data, and perform computations on the data.A data structure is a named location that can be used to store and organize data. And, an algorithm is a collection of steps to solve a particular problem. Learning data structures and algorithms allow us to write efficient and optimized computer programs.Our DSA tutorial will guide you to learn different types of data structures and algorithms and their implementations in Python, C, C++, and Java.A data structure is not only used for organizing the data. It is also used for processing, retrieving, and storing data. There are different basic and advanced types of data structures that are used in almost every program or software system that has been developed. So we must have good knowledge about data structures. Linear data structure: Data structure in which data elements are arranged sequentially or linearly, where each element is attached to its previous and next adjacent elements, is called a linear data structure.   Examples of linear data structures are array, stack, queue, linked list, etc. data structure: Static data structure has a fixed memory size. It is easier to access the elements in a static data structure. An example of this data structure is an array.Dynamic data structure: In dynamic data structure, the size is not fixed. It can be randomly updated during the runtime which may be considered efficient concerning the memory (space) complexity of the code. Examples of this data structure are queue, stack, etc.Non-linear data structure: Data structures where data elements are not placed sequentially or linearly are called non-linear data structures. In a non-linear data structure, we can’t traverse all the elements in a single run only.  "
    },
    {
      "_id": "61f9ce168f7b15aadecb1d1fc80c72f7ihy789uit548754",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "06",
      "title": "Welcome to the World of Digital Marketing",
      "balance": "1000",
      "image_url": "https://skeegten.com/wp-content/uploads/2020/05/DGT.jpg",
      "details": "Not all digital marketing agencies are built the same way. For one thing, some agencies are much larger or smaller than others, or they offer services to different geographical regions. But another crucial distinction between different agencies is in which services they offer.Some agencies specialize in a particular area of marketing — for example, maybe one agency focuses entirely on designing websites. if you want a comprehensive marketing plan, you can benefit from partnering with an agency that offers full-stack digital marketing services.Full-stack digital marketing is a form of digital marketing that encompasses a wide variety of marketing types rather than focusing on a single strategy. As mentioned above, many companies choose to focus their efforts on one specialty, be it web design or paid ads.Full-stack agencies, however, opt for a “jack-of-all-trades” setup, providing online marketing services across the board.If your business only needs help with one strategy, a single-service agency might be fine. But if you need help with all your online marketing, you’ll want to partner with a full-service agency. Let’s say you need help with your paid advertising and social media. You could go to one agency for paid ads and another for social media, but then you’d have to keep up with two separate agencies that wouldn’t be in sync with one another.A full-service agency, however, could handle both of those strategies.That would enable you to concentrate your attention in one place and synchronize your various campaigns."
    }
  ]